nuture_api/app/controllers/orders_controller.rb

INSERT INTO "orders" ("customer_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["customer_id", 1], ["created_at", "2020-01-02 19:45:32.515318"], ["updated_at", "2020-01-02 19:45:32.515318"]]
SELECT "plant_orders".* FROM "plant_orders" WHERE "plant_orders"."order_id" = $1  [["order_id", 1]]
---
    def create

        @order =Order.create(order_params)

        params[:plant_ids].map{ |plantId| PlantOrder.create(order: @order, plant_id: plantId)}