nuture_api/app/controllers/plants_controller.rb

SELECT "plants".* FROM "plants"
---
    def index
        @plants = Plant.all

SELECT "plants".* FROM "plants" WHERE "plants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @plant = Plant.find(params[:id])